// - Користувач вводить або має два числа.
    // Потрібно знайти та вивести максимальне число з тих двох .
    // Також потрібно врахувати коли введені рівні числа.
let a = +prompt('Ввведіть число 1');
let b = +prompt('Ввведіть число 2');
if (a>b){
    document.write('<h2> Maксимальне число перше</h2>')
} else if (a<b){
    document.write('<h2> Maксимальне число друге</h2>')
} else document.write('<h2> Два числа рівні</h2>');


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
    // Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let houseNumber =1;
if (houseNumber>=1 && houseNumber<=20){
    console.log('Перший підїзд')
} else if (houseNumber>=21 && houseNumber<=48){
    console.log('Другий підїзд')
} else if (houseNumber>=49 && houseNumber<=90){
    console.log('Третій підїзд')
} else console.log('Некоректний номер квартири');

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = +prompt('Введіть число');
if (number === 10){
    document.write('<h2> ВІРНО</h2>')
} else document.write('<h2> НЕВІРНО</h2>');

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
    // якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

let x =  1;
if (typeof x === 'number'){
    console.log('1')
} else if (typeof x === "string"){
    console.log('2')
} else  if (typeof x === "boolean"){
    console.log('3')
} else if (typeof x === "object"){
    console.log('4')
} else console.log('невідомий тип');



// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
    // Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
    // Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let tempature = 10;
if (tempature>=10 && tempature<=22){
    console.log('ми йдемо ВЧИТИСЯ')
} else console.log('сидимо вдома і вчимося ОНЛАЙН');

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
    // числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let key = +prompt('Введіть число від 1 до 5');
switch (key){
    case 1:
        document.write('<p>Ваш приз Авто</p>');
        break;
    case 2:
        document.write('<p>Ваш приз Мото</p>');
        break;
    case 3:
        document.write('<p>Ваш приз Телефон</p>');
        break;
    case 4:
        document.write('<p>Ваш приз Квартира</p>');
        break;
    case 5:
        document.write('<p>Ваш приз Ноутбук</p>');
        break;
    default: document.write('<p>Число не вірне</p>');
}