// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
    // Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
let i = friends.length;
if (i>=3){
    document.write('<h2>Це великий масив,в якому 3 або більше елементів</h2>')
} else document.write('<h2>Це маленький масив,в якому менше 3-х елементів</h2>');


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
    // Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 4;
let b= 1;
let c = 8;
let max;
let min;
let midl;
if (a>b && a>c){
    max = a
} else if (b>a && b>c){
    max = b
} else if (c>a && c>b){
    max = c;
}
if (a<b && a<c){
    min = a
} else if (b<a && b<c){
    min = b
} else if (c<a && c<b){
    min = c;
}
if (a!== min && a!== max){
    midl =a
    console.log('Посередині число перше')
} else if (b!==min && b!==max ){
    midl = b
    console.log('Посередині число друге')
} else if (c!==min && c!== max){
    midl = c
    console.log('Посередині число третє');
}

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

let aa=4;
let bb=4;
let result = (aa+bb) > 4 ? 'Багато' : 'Мало';
console.log(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let number = 0;
let compare_result = number<0 ? 'Число негативне' : number === 0 ? 'Число рівне нулю' :  number > 0 ? 'Число позитивне': false;
console.log(compare_result);